policies/AM-BuildRequestValidateHSS.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<AssignMessage async="false" continueOnError="false" enabled="true" name="AM-BuildRequestValidateHSS">
    <DisplayName>AM-BuildRequestValidateHSS</DisplayName>
    <Add>
        <Headers>
            <Header name="SOAPAction"/>
        </Headers>
    </Add>
    <Set>
        <Payload contentType="text/xml">
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soapadapter.provgw">
                <soapenv:Header/>
                <soapenv:Body>
                    <spml:searchRequest xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0" xmlns:subscriber="urn:siemens:names:prov:gw:ALTANMEXSUBSCRIBER:1:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" language="en_us">
                        <version>ALTANMEXSUBSCRIBER_v10</version>
                        <base>
                            <objectclass>Subscriber</objectclass>
                            <alias name="msisdn" value="52{msisdn}"/>
                        </base>
                    </spml:searchRequest>
                </soapenv:Body>
            </soapenv:Envelope>
        </Payload>
        <Verb>POST</Verb>
    </Set>
    <AssignVariable>
        <Name>forward.target.url</Name>
        <Value>http://34.237.230.77:8089/ProvisioningGateway/services/SPMLALTANMEXSubscriber10Service</Value>
        <!--<Value>http://34.237.230.77:8999/cgi-bin/mme/bloqueo.cgi</Value>-->
    </AssignVariable>
    <AssignVariable>
        <Name>OriginVerb</Name>
        <Value>GET</Value>
    </AssignVariable>
    <AssignTo createNew="false" transport="http" type="request"/>
</AssignMessage>